<script>
	export default {
		watch: {
			$route: {
				immediate: true,
				handler(to) {
					document.title = to.meta.title || 'Microbiomir: главная страница';
				}
			}
		},
	}
</script>

<template>
	<main class="main-container">
		<div class="content-container">
			<div class="description-container">
				<h3>Оглавление</h3>
				<nav>
					<ul class="list">
						<li>
							<a href="#introduction">Введение</a>
						</li>
						<li>
							<a href="#ecosystem">Общее представление об экосистемах</a>
						</li>
						<li>
							<a href="#information">Материал и методика исследований</a>
						</li>
						<li>
							<a href="#results">Результаты исследований</a>
						</li>
						<li>
							<ul class="list post">
								<li>
									<a href="#infusoria-slipper">Инфузория-туфелька</a>
								</li>
								<li>
									<a href="#daphnia">Дафния</a>
								</li>
								<li>
									<a href="#spirogyra">Спирогира</a>
								</li>
								<li>
									<a href="#diatom">Диатомовые водоросли</a>
								</li>
							</ul>
						</li>
						<li>
							<a href="#end">Итоги</a>
						</li>
					</ul>
				</nav>

				<h3 id="introduction">Введение</h3>
				<img src="@/assets/images/earth.png" alt="Картинка к заголовку">
				<p>
					Когда я гулял на улице, иногда смотрел на лужи. Через несколько дней, я заметил, что они стали менять свой цвет. Вода в лужах приобретала зеленоватый оттенок и становилась мутнее. Мне стало интересно, из-за чего всё это происходит. Я захотел во всём разобраться на микроскопическом уровне, потому что интересуюсь микробиологией. Когда всё было готово для проведения наблюдений в микроскоп, мне в голову пришла идея совместить мой проект по информатике с проектом по биологии. Я решил создать сайт, на котором разместить 3D модели, описание и фотографии, увиденных в луже организмов.
				</p>
				<p>
					У меня появилась такая мысль, потому что в свободное от учёбы время, я занимаюсь программированием: создаю различные проекты, участвую в конкурсах и обучаюсь на курсах.
				</p>
				<h4>Цель</h4>
				<p>
					Изучить экосистему временных водоёмов и разместить полученную информацию на сайте.
				</p>
				<h4>Задачи</h4>
				<ol>
					<li>Собрать пробы с водой из луж</li>
					<li>Изучить пробы воды под микроскопом</li>
					<li>Сделать выводы на основе полученной информации</li>
					<li>Создать понятный дизайн сайта</li>
					<li>Создать сайт по дизайну</li>
					<li>Создать 3D модели увиденных в луже организмов</li>
					<li>Загрузить 3D модели на сайт</li>
					<li>Выложить сайт в интернет</li>
				</ol>
				<h4>Актуальность</h4>
				<p>
					Актуальность данного проекта заключается в том, что многим подросткам тяжело даётся биология, мой ресурс должен помочь им в изучении данного предмета. Также большая часть населения Земли проводит много времени в интернете. Люди привыкли к интернету, и поэтому через него будет легче объяснить какую-либо тему обучающимся. Также большое количество людей интересуется микробиологией.
				</p>
				<h3 id="ecosystem">Общее представление об экосистемах</h3>
				<img src="@/assets/images/ecosystem.png" alt="Картинка к заголовку">
				<p>
					Экосистема, или экологическая система - основная природная единица на поверхности Земли, совокупность совместно обитающих организмов и условий их существования, находящихся в закономерной взаимосвязи друг с другом и образующих систему.
				</p>
				<p>
					Одно из основных понятий в науке Экология. Это биологическая система, состоящая из сообщества живых организмов, среды их обитания, системы связей, осуществляющей обмен веществ и энергии между ними.
				</p>
				<p>
					Пример экосистемы - пруд с обитающими в нём растениями, рыбами, беспозвоночными животными, микроорганизмами, составляющими живой компонент системы. Для пруда как экосистемы характерны донные отложения определённого состава, химический состав и физические параметры, а также определённые показатели биологической продуктивности, трофический статус водоёма и специфические условия данного водоёма. Другой пример экологической системы - лиственный лес в средней полосе России с определённым составом лесной подстилки, характерной для этого типа лесов почвой и устойчивым растительным сообществом, и, как следствие, со строго определёнными показателями микроклимата и соответствующим таким условиям среды комплексом животных организмов. Немаловажным аспектом, позволяющим определять типы и границы экосистем, является трофическая структура сообщества и соотношение производителей биомассы, её потребителей и разрушающих биомассу организмов, а также показатели продуктивности и обмена вещества и энергии.
				</p>
				<h3 id="information">Материал и методика исследований</h3>
				<p>
					Для изучения экосистемы луж, я, начиная с 11.09.2022, брал через день по 1-ой пробе воды из лужи, которая находилась рядом с моим домом. Когда у меня накопилось 11 проб с водой, я начал исследование, которое проводилось, с помощью микроскопа "Микромед С-11". Я присоединил к микроскопу с помощью специального крепежа мой телефон, впоследствии у микроскопа увеличение стало больше из-за цифрового зума.
				</p>
				<p>
					Дизайн сайта я делал в графическом редакторе Figma. 3D модели я делал в программе Blender 3D. Код сайта я писал в программе Visual Studio Code.
				</p>
				<p>
					Сначала я начал делать 3D модели, после того, как я сделал 1 3D модель, я начал делать дизайн сайта. Как только я доделал дизайн, я начал делать сайт по дизайну.
				</p>
				<h3 id="results">Результаты исследований</h3>
				<p>
					Во время исследования, я нашёл нитчатые водоросли - спирогиру, инфузорию туфельку, дафнию и диатомовые водоросли.
				</p>
				<h4 id="infusoria-slipper">Инфузория-туфелька</h4>
				<img src="@/assets/images/infusoria.png" alt="Картинка к заголовку">
				<p>
					Инфузория-туфелька - вид инфузорий, одноклеточных организмов из группы альвеолят. Иногда инфузориями-туфельками называют и другие виды рода Paramecium.
				</p>
				<p>
					Встречается в любых стоячих пресных водоёмах с разлагающимися органическими веществами. Её можно обнаружить и в аквариуме, взяв пробы воды с илом и рассмотрев их под микроскопом.
				</p>
				<p>
					Инфузория-туфелька - очень крупное простейшее, размер составляет 0,5 мм. По форме тела напоминает подошву туфли. Наружный плотный слой цитоплазмы (пелликула) включает находящиеся под наружной мембраной плоские мембранные цистерны (альвеолы), микротрубочки и другие элементы цитоскелета.
				</p>
				<p>
					На поверхности клетки в основном продольными рядами расположены реснички, количество которых - от 10 до 15 тыс. Они могут располагаться через равное расстояние друг от друга, а могут быть сгруппированы в пучки. В основании каждой реснички находится базальное тельце, а рядом - второе, от которого ресничка не отходит. С базальными тельцами у инфузорий связана инфрацилиатура - сложная система цитоскелета. У туфельки она включает отходящие назад посткинетодесмальные фибриллы и радиально расходящиеся поперечно исчерченные филаменты. Возле основания каждой реснички имеется впячивание наружной мембраны - парасомальный мешочек.
				</p>
				<p>
					Между ресничками расположены мелкие веретеновидные тельца - трихоцисты, которые рассматриваются как органоиды защиты. Они расположены в мембранных мешочках и состоят из тела и наконечника. Трихоцисты - разновидность разнообразных по строению органоидов экструсом, наличие которых характерно для инфузорий и некоторых других групп протистов. Их тело имеет поперечную исчерченность с периодом 7 нм. В ответ на раздражение трихоцисты выстреливают - мембранный мешочек сливается с наружной мембраной, а трихоциста за тысячные доли секунды удлиняется в 8 раз. Предполагается, что трихоцисты, набухая в воде, могут затруднять движение хищника. Известны мутанты туфелек, лишённые трихоцист и вполне жизнеспособные. Всего у туфельки 5-8 тысяч трихоцист.
				</p>
				<p>
					У туфельки 2 сократительные вакуоли в передней и задней части клетки. Каждая состоит из резервуара и отходящих от него радиальных каналов. Резервуар открывается наружу порой, каналы окружены сетью тонких трубочек, по которым жидкость поступает в них из цитоплазмы. Вся система удерживается в определённом участке цитоскелетом из микротрубочек.
				</p>
				<p>
					У туфельки имеется два разных по строению и функциям ядра - диплоидный микронуклеус (малое ядро) округлой формы и полиплоидный макронуклеус (большое ядро) бобовидной формы.
				</p>
				<h4 id="daphnia">Дафния</h4>
				<img src="@/assets/images/daphnia.png" alt="Картинка к заголовку">
				<p>
					Дафнии - мелкие рачки (размеры тела взрослых особей от 0,6 до 6 мм). Они населяют все типы стоячих континентальных водоёмов, встречаются также во многих реках с медленным течением. В лужах, прудах и озёрах часто имеют высокую численность и биомассу. Дафнии - типичные планктонные рачки, большую часть времени проводящие в толще воды. Различные виды населяют мелкие временные водоёмы. литораль и пелагиаль озёр. Довольно многие виды, особенно населяющие засушливые районы - галофилы, обитающие в солоноватых, солёных и гипергалинных континентальных водоёмах.
				</p>
				<h4 id="spirogyra">Спирогира</h4>
				<img src="@/assets/images/spirogira.png" alt="Картинка к заголовку">
				<p>
					Спирогира - род нитчатых харофитовых водорослей из семейства зигнемовых. Тело спирогиры - неветвящаяся нить, свободноплавающая или прикрепленная к субстрату ризоидами, состоящая из одного ряда цилиндрических клеток. Оболочкой каждой клетки является целлюлозная клеточная стенка, покрытая снаружи слизью. Большую часть клетки занимает вакуоль с клеточным соком. На цитоплазматических тяжах, проходящих через вакуоль, подвешено одно ядро. Оно крупное и округлое. В каждой клетке имеется по одному и более спирально закрученных хлоропластов, напоминающих ленты, расположенные в пристеночном слое цитоплазмы. Вследствие большой величины клеток спирогиры, достигающей у некоторых её видов 0,01 мм, а также вследствие простоты их строения, эта водоросль является одной из наиболее изученных и служит классическим объектом при изучении анатомии клетки водоросли.
				</p>
				<h4 id="diatom">Диатомовые водоросли</h4>
				<img src="@/assets/images/diatoma.png" alt="Картинка к заголовку">
				<p>
					Диатомовые водоросли, или диатомеи, или бациллариофициевые водоросли - группа водорослей, отличающаяся наличием у клеток своеобразного «панциря», состоящего из диоксида кремния. Всегда одноклеточны, но встречаются колониальные формы. Обычно планктонные или перифитонные организмы, морские и пресноводные.
				</p>
				<p>
					Являясь важнейшей составляющей морского планктона, диатомовые создают до четверти всего органического вещества планеты.
				</p>
				<p>
					У диатомовых хлоропласты разнообразной формы, обычно пристенные. У центрических диатомей они обычно многочисленные, мелкие, у пеннатных крупные, часто лопастные. Хлоропласты имеют типичное для охрофитов строение. Пиреноидов может быть несколько, они выступают за пределы хлоропласта и иногда пронизаны тилакоидами.
				</p>
				<h3 id="end">Итоги</h3>
				<ul>
					<li>Я набрал 11 проб с водой, которые изучил с помощью микроскопа.</li>
					<li>Я написал статью по полученным данным.</li>
					<li>Я сделал дизайн для сайта и сам сайт.</li>
					<li>Я создал 3D-модель клетки спирогиры и загрузил её на сайт.</li>
					<li>Я выложил сайт в интернет.</li>
				</ul>
			</div>
		</div>
	</main>
</template>

<style>

</style>